# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
# ######################################################################################################################################################.H.S.##
# FILE:        index.org
#+TITLE:       Fortran Finance
#+SUBTITLE:    Retirement Simulation
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2025-01-02
#+DESCRIPTION: Documentation for monte carlo examples in the Fortran Finance repository.
#+KEYWORDS:    finance fortran monte carlo inflation cashflow time value of money tvm percentages taxes stock market
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil 
#+SEQ_TODO:    TODO:NEW(t)                         TODO:WORK(w)    TODO:HOLD(h)    | TODO:FUTURE(f)   TODO:DONE(d)    TODO:CANCELED(c)
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
# Change max-width to get wider output -- also note #content style below
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>.subtitle { font-size: 0.6em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
** Just Starting Out
:PROPERTIES:
:CUSTOM_ID: case_20_intro
:END:

#+begin_src sh :results output raw :exports results 
grep -v '^ *$' ~/world/my_prog/finance/FortranFinance/retirement_simulation/config_20.nml | grep -B 10 '^!---' | grep -A 10 '^!---' | grep -v '^!---' | sed 's/^! *//'
#+end_src

#+RESULTS:
Here we have a couple starting to save for retirement at age 25.  They both have good jobs earning 100K, and they
spend 100K per year on expenses.  Work income is growing at 2.5%. They currently have no retirement savings, but wish
to start saving aggressively.  They believe they can earn 4% on investments, and inflation will be about 3%.  Note work
income is not keeping up with inflation. They have 10K in checking and 10K in an emergency fund.  The checking account
earns 0.01% interest, and the emergency fund is in CDs earning 3%.

** Approaching Retirement
:PROPERTIES:
:CUSTOM_ID: case_60_intro
:END:

#+begin_src sh :results output raw :exports results 
grep -v '^ *$' ~/world/my_prog/finance/FortranFinance/retirement_simulation/config_60.nml | grep -B 10 '^!---' | grep -A 10 '^!---' | grep -v '^!---' | sed 's/^! *//'
#+end_src

#+RESULTS:
Here we have a couple (47 & 55 years old).  Each have 500k in a 401k.  They plan on putting 50% in the S&P, and 50% in
low risk 5% funds. They also have 100k balances in both an emergency fund and checking account.  The checking account
earns 0.01% interest, and the emergency fund is in CDs earning 3%. They are both employed, and are have aggressively
saving at the maximum rate into a 401k.  They spend 110K per year on expenses.  They believe inflation will be about
3%.  They both wish to stop working when they are 60. The younger person will start taking SS at 63 while the older
one will start at age 70.

